package day01;

public class Variable {

	public static void main(String[] args) {
//		주석(comment) ctrl + /
//		주석이란, 컴퓨터가 코드를 번역할 때 무시하는 부분으로
//		슬래시(/)를 두 번 적은 뒤쪽의 내용은
//		코드를 실행할 때 무시한다.
//		1. 코드에 대한 설명은 다른 개발자, 혹은 미래의 나에게
//		설명할 때 사용된다.
//		2. 실행하는 코드 중간에 임시로 실행을 막고자 할 때
//		주석으로 바꾸어 실행하지 않도록 처리한다(주석처리)
		
//		여러 줄 주석
//		여러 칸을 선택한 뒤 ctrl + shift + /를 눌러서
//		범위 주석으로 처리할 수 있다.
		/* */
		
//		변수(variable)
//		변수란 값을 담기 위한 저장공간을 의미하며
//		이를 선언하기 위해서는 변수의 타입과 변수명을 적어야 한다.
//		★모든 자바 코드는 마지막에 세미콜론;을 적어주어야 한다.
//		세미콜론;은 한 줄의 코드가 실행이 끝났음을 의미하는
//		마침표 역할을 한다.
		int var; // var라는 저장공간을 int타입으로 선언
		var = 10; // var라는 저장공간에 10이라는 값을 대입
//		출력문
//		print line
//		System.out.println(출력하고 싶은 값);
		System.out.println(var);
		
//		데이터 타입의 종류
//		1. 숫자형
//		1-1. 정수형: 소수점이 없는 숫자
//			int: 정수형 대표
//		short, int, long
//		1-2. 실수형: 소수점이 있는 숫자
//			float: 작은 실수를 나타낼 때 사용된다.
//				1.0f, 3.14f
//			double: 실수형 대표로 실수값을 작성했을 때
//				double로 처리된다.
//				3.14 0.11110
		
//		2. 문자형(character)
//			char: 하나의 문자를 작은따옴표''에 감싸서 표현한다.
//				'홍', '1', ' ', 'a',...
//			String: 문자열 - 여러개의 문자를 큰따옴표""에 감싸서 표현하는 타입으로,
//			다른 데이터타입과 다르게 대문자로 시작한다.
//			"홍길동", "1234", "", " ? ",...
		
//		3. 논리형
//			boolean: 참과 거짓, 두 가지 값만 존재하는 데이터 타입으로
//			true, false로 표현된다.
		
		
		
		
		
	}

}
